import React, { Component } from 'react';
import { Image,StatusBar } from 'react-native';
import { Container, Header, Content, Card, CardItem, Text, Body,Title, } from 'native-base';

export default class Tips02TH extends Component {

  render() {
    return (
      <Container>
        <Header>
          <Body>
            <Title>พฤติกรรมการขับถ่ายของแมว</Title>
          </Body>
        </Header>
        <Content>
            <Card transparent>
              <Body>
                <CardItem>
                    <Image source={require('../../img/swiper-2.jpg')} style={{height: 200, width: 400}}/>
                </CardItem>
              </Body>
              <CardItem>
                <Text style={{fontWeight: 'bold', fontSize: 18}}>ปัญหาการขับถ่าย</Text>
              </CardItem>
              <CardItem>
                <Text>        คนที่เลี้ยงแมวส่วนใหญ่จะฝึกนิสัยการขับถ่ายให้ลูกแมวตั้งแต่ยังเล็กๆ โดยการหาถาดหรือกระบะทรายให้แมวขับถ่าย เมื่อแมวขับถ่ายเป็นปกติหรือเคยขับถ่ายอย่างเป็นระบบ แต่เมื่อมีพฤติกรรมเปลี่ยนไปไม่ยอมขับถ่ายในกระบะที่เราเตรียมไว้ ปัญหานี้อาจเกิดจากกระบะทรายแมวไม่ได้รับการทำความสะอาดที่ดีพอ ทำให้แมวขับถ่ายไม่เป็นที่หรือไม่ขับถ่ายในถาดทรายที่เตรียมไว้ ควรรีบสำรวจและทำความสะอาดหรือเปลี่ยนทรายใหม่ ไม่ควรตีหรือทำโทษเพราะจะทำให้แมวหวาดระแวงและฝึกสอนไม่ได้อีก ลูกแมวจะสามารถควบคุมการขับถ่ายได้เอง เมื่ออายุ 3 สัปดาห์ และเมื่ออายุได้ 1 เดือน จะเริ่มรู้จักการหาที่สำหรับขับถ่ายโดยสังเกตจากพฤติกรรมของแม่แมวและอาศัยการกระตุ้นจากกลิ่น การขุดและการกลบฝัง หลังขับถ่ายเสร็จเป็นพฤติกรรมโดยธรรมชาติของแมว จึงไม่มีความจำเป็นต้องฝึกให้ลูกแมวขับถ่ายเป็นที่ ยกเว้นแต่กรณีที่เป็นลูกแมวกำพร้าซึ่งถูกเลี้ยงอยู่ตัวเดียวในบ้าน การฝึกไม่มีอะไรมาก แค่ทุกครั้งหลังจากที่ลูกแมวกินอาหารเสร็จให้อุ้มไปไว้ในกระบะทราย ปล่อยลูกแมวไว้เฉยๆ ห้ามจับบังคับเท้าลูกแมวไปคุ้ยทราย หรือปิดกั้นไม่ให้ลูกแมวออกจากกระบะ เพราะเท่ากับสร้างประสบการณ์ด้านลบกับการใช้กระบะทราย ในช่วงแรกถ้าลูกแมว เริ่มขับถ่ายในกระบะอาจทิ้งสิ่งขับถ่ายไว้เล็กน้อยอย่าตักทิ้งหมด เพื่อกระตุ้นให้ลูกแมวมาขับถ่ายที่เดิม เมื่อคุณทำซ้ำหลายๆ วันเข้าลูกแมวจะเรียนรู้ที่จะขับถ่ายที่กระบะทรายเองไม่ว่าจะแมวเด็กแมวโต แมวเพศผู้หรือเพศเมียพฤติกรรมการขับถ่ายจะมีขั้นตอนที่เหมือนกัน โดยเริ่มจากการเล็งหาที่สำหรับขับถ่าย เมื่อได้สถานที่แล้วก็จะเริ่มขุดเป็นหลุมตื้น ๆ ย่อตัวลงเพื่อขับถ่ายลงในหลุม หันไปดมก่อนที่จะกลบในท้ายที่สุด แมวบางตัวอาจจะไม่ได้ทำทุกขั้นตอนตามนี้ แต่ถ้าปกติแมวของคุณทำครบทุกขั้นตอนแล้วอยู่ดีๆ มีบางขั้นตอนหายไป เช่น รับเข้าไปถ่ายแล้วรีบอออกโดไม่ขุดหลุมกลบ หรือมีอาการแปลกๆ เช่น เขย่าขาแรงๆ ระหว่างอยู่ในกระบะทราย นั่นเป็นไปได้ว่าการจัดการห้องน้ำแมวที่บ้านของคุณกำลังมีปัญหาและจำเป็นต้องแก้ไข</Text>
              </CardItem>
              <CardItem>
                <Text style={{fontWeight: 'bold', fontSize: 18,}}>ปัจจัยที่มีผลต่อการตัดสินใจใช้ห้องน้ำของแมว</Text>
              </CardItem>
              <CardItem>
                <Text style={{fontWeight: 'bold'}}>        1.สถานที่<Text style={{fontWeight: 'normal'}}> ควรวางกระบะทรายไว้ในห้องที่แมวมักใช้เวลาส่วนใหญ่อยู่ในบริเวณนั้น โดยวางในบริเวณที่ง่ายที่แมวจะเข้าถึง ห้ามวางไว้ใกล้กับบริเวณที่กินน้ำ กินอาหาร หรือบริเวณที่นอนพักผ่อนของแมว ห้องที่เลือกวางกระบะทรายควรจะเงียบและไม่มีคนพลุกพล่าน ควรหลีกเลี่ยงห้องครัวหรือห้องดูทีวีที่มักมีเสียงดัง หากเจ้าของต้องการย้ายกระบะทรายจากที่เดิมไปบริเวณที่เหมาะสมกว่าให้ค่อยๆ ขยับกระบะทรายวันละ 1 นิ้ว จะช่วยลดความเครียดจากการเปลี่ยนที่วางกระบะทรายได้  สำหรับบ้านที่มีปัญหาการทะเลาะกันของแมวภายในบ้านข้อควรระวังอีกอย่างในการเลือกสถานที่ คือ ควรวางกระบะทรายไว้ในห้องที่มีทางออกมากกว่า 1 ทาง ห้องที่มีทางออกทางเดียว เช่น ห้องน้ำ ห้องเก็บของ อาจทำให้แมวคู่อริไปดักที่ปากทางจนแมวอีกตัวไม่กล้าเข้าห้องน้ำ หรือบางตัวอาจโดนดักทำร้ายขณะกำลังออกจากห้องหลังขับถ่ายเสร็จ</Text></Text>
              </CardItem>
              <CardItem>
                <Text style={{fontWeight: 'bold'}}>        2.กระบะทราย<Text style={{fontWeight: 'normal'}}> กระบะทรายที่ดีควรมีขนาดอย่างน้อย 1.5 เท่า ของความกว้างและยาวของตัวแมว เนื่องจากเวลาขับถ่ายแมวจะเข้าไปอยู่ในกระบะทรายทั้งตัว ที่เห็นใช้กันทั่วไปเป็นถาดพลาสติกซึ่งแมวเรียนรู้ที่จะใช้ได้ง่าย และทำความสะอาดง่าย กระบะทรายแบบมีฝาครอบเป็นอีกประเภทที่เจ้าของบางคนเลือกใช้ ข้อดีคือความเงียบสงบเป็นส่วนตัว และแมวคุ้ยทรายไม่กระจายออกมา หรือสุนัขในบ้านจะเข้าไปคุ้ยทรายเล่นก็ไม่ได้ แต่ก็มีข้อเสีย คือ การระบายอากาศภายในไม่ดี จำเป็นต้องทำความสะอาดบ่อยๆ และแมวบางตัวอาจไม่ชอบที่แคบที่ไม่มีทางให้หลบหนีข้อมูลทางสถิติพบว่าแมวส่วนมากชอบกระบะทรายแบบเปิดโล่งมากกว่า ถ้าอยู่ในสถานที่ที่สงบพอ ส่วนบ้านที่มีแมวอายุมากกว่า 10 ปี หรือแมวที่เป็นโรคข้ออักเสบ ให้พิจารณาใช้กระบะทรายแบบมีช่องเปิดด้านข้างให้เข้า จะช่วยให้แมวก้าวขาเข้ากระบะทรายได้ง่ายกว่าแบบปกติ</Text></Text>
              </CardItem>
              <CardItem>
                <Text style={{fontWeight: 'bold'}}>        3.ทราย<Text style={{fontWeight: 'normal'}}> ทรายแมวที่ใช้บ่อยมีอยู่ 3 ประเภท คือ</Text></Text>
              </CardItem>
              <CardItem>
                <Text>        Clay Litters แมวส่วนมากมักจะชอบทรายประเภทนี้ เนื่องจากใกล้เคียงกับความเป็นธรรมชาติ โดยเฉพาะชนิดที่มีเนื้อค่อนข้างละเอียดทรายพวกนี้มีคุณสมบัติดูดซับปัสสาวะได้พอใช้และแค่ช่วยปกคลุมสิ่งขับถ่ายไว้ ทำให้ลดกลิ่นได้ไม่มาก จึงจำเป็นต้องตักสิ่งขับถ่ายและทรายที่เลอะออกบ่อย ๆ</Text>
              </CardItem>
              <CardItem>
                <Text>        Clumping Litters ทรายประเภทนี้เมื่อเจอกับปัสสาวะจะจับกันเป็นก้อน ทำให้ง่ายต่อการดักทิ้ง แต่มีข้อเสียคือเนื้อทรายที่ละเอียดมากกว่าประเภทอื่นทำให้มีลักษณะเป็นฝุ่นและมักติดเท้าแมวไปเลอะในที่ต่างๆ ตามบ้าน จึงควรเลือกดูยี่ห้อที่มีฝุ่นน้อย</Text>
              </CardItem>
              <CardItem>
                <Text>        Silica pellet Litters มีการดูดซับปัสสาวะได้ดีมากทำให้แทบไม่มีปัญหาเรื่องกลิ่นเลย เมื่อดูดซับปัสสาวะตัวซิลิกาจะเปลี่ยนสีทำให้เจ้าของตักทิ้งและเปลี่ยนได้เร็วเพราะสังเกตเห็นได้ง่าย ข้อเสียเดียว คือแมวบางตัวจะไม่ชอบลักษณะเนื้อของซิลิกาที่เป็นของสังเคราะห์ และต่างจากทราบหรือดินในธรรมชาติค่อนข้างมาก</Text>
              </CardItem>
              <CardItem>
                <Text>        แมวแต่ละตัวจะมีความชอบในทรายแต่ละประเภทแตกต่างกันไป ทำให้ในช่วงแรกเจ้าของจำเป็นต้องทดลองนำกระบะทรายหลาย ๆ ใบใส่ทราบแต่ละแบบไว้แล้วมาวางติด ๆ กัน สังเกตว่าแมวของคุณขอบไปขับถ่ายบนทรายแบบไหน อย่าลืมว่าปริมาณทรายที่ใส่ต้องเพียงพอ ให้แมวขุดก่อนขับถ่ายและกลบหลังถ่ายเสร็จ เพื่อให้แมวได้แสดงออกทางพฤติกรรมอย่างเหมาะสม ที่แนะนำคือควรมีระดับความสูงของทรายอย่างน้อย 3 ถึง 4 นิ้ว</Text>
              </CardItem>
              <CardItem>
                <Text style={{fontWeight: 'bold'}}>        4.ความสะอาดและกลิ่น<Text style={{fontWeight: 'normal'}}> คนไม่ชอบเข้าห้องน้ำสาธารณะที่สกปรกอย่างไร แมวก็เป็นเหมือนกัน ในธรรมชาติของแมวส่วนมากจะมีการขับถ่ายปัสสาวะวันละ 2 ถึง 4 ครั้ง และอุจจาระวันละ 1 ครั้ง ซึ่งเราคงไม่สามารถทำความสะอาดได้ทั้งวัน เจ้าของจำเป็นต้องตักทรายส่วนที่สกปรกออกจากกระบะทรายอย่างน้อยละวัน 1 วัน 2 ครั้ง แต่ในกรณีที่เลี้ยงแมวมากกว่า 1 ตัว การตักทำความสะอาดจำเป็นต้องบ่อยกว่านั้นเพราะแมวจะไม่ชอบเลย ถ้ามีกลิ่นสิ่งขับถ่ายของแมวตัวอื่นอยู่ในกระบะทราย</Text></Text>
              </CardItem>
              <CardItem>
                <Text style={{fontWeight: 'bold'}}>        5.ประสบการณ์และสุขภาพ<Text style={{fontWeight: 'normal'}}> เจ้าของควรหลีกเลี่ยงการสร้างประสบการณ์ที่ไม่ดีให้กับแมว เมื่อแมวอยู่ที่กระบะทราย อย่าเข้าไปรบกวน อย่าจับมาอุ้มเล่น หรือพยายามป้อนยาแมวที่บริเวณนั้น เพราะเหตุการณ์เหล่านี้จะทำให้แมวไม่อยากมาที่กระบะทรายอีก หมั่นพาแมวไปตรวจสุขภาพอยู่เสมอๆ ถ้าพบเห็นสิ่งผิดปกติ แมวที่มีอาการท้องผูก หรือกระเพาะปัสสาวะอักเสบ มักเชื่อมโยงความรู้สึกเจ็บปวดในการขับถ่ายกับการใช้กระบะทรายไว้ด้วยกัน</Text></Text>
              </CardItem>
            </Card>
        </Content>
      </Container>
    );
  }
}
